## How to Impute Missing Values in a Dataset
Imputing missing values is a common task in data preprocessing. Here are some methods to handle missing data:
1. **Mean/Median/Mode Imputation**:
   - For numerical data, replace missing values with the mean or median of the column.
   - For categorical data, replace missing values with the mode (most frequent value).
2. **Forward Fill/Backward Fill**:
   - Use the last known value to fill in missing values (forward fill).
    - Use the next known value to fill in missing values (backward fill).

### first method: Mean/Median/Mode Imputation
```python

In [17]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
from sklearn.impute import SimpleImputer

# load titanic dataset from seaborn
df = sns.load_dataset('titanic')
# display first 5 rows
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
# get info about dataset

df.info()
# print shape of dataset
print("Shape of dataset:", df.shape)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB
Shape of dataset: (891, 15)

In [7]:

# check missing values and arrange in descending order
df.isnull().sum().sort_values(ascending=False)

age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
parch            0
sibsp            0
class            0
fare             0
who              0
adult_male       0
alive            0
alone            0
dtype: int64

In [4]:
# drop the deck column as it has too many missing values
df.drop('deck', axis=1, inplace=True, errors='ignore')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [18]:
# check the missing values again
df.isnull().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

In [30]:
# drop deck column as it has too many missing values
df3 = df.copy()
df3.drop(columns=['deck'], inplace=True, errors='ignore')
df3.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True

In [31]:
# impute missing values in age column with mean value using pandas

df3['age'] = df3['age'].fillna(df3['age'].mean())
# check missing values again and display

df3.isnull().sum().sort_values(ascending=False)

embark_town    2
embarked       2
sex            0
age            0
survived       0
pclass         0
parch          0
sibsp          0
class          0
fare           0
who            0
adult_male     0
alive          0
alone          0
dtype: int64

In [33]:
# impute missing values in embarked column with most frequent value using pandas
#df4 = df.copy()
df3['embarked'] = df3['embarked'].fillna(df3['embarked'].mode()[0])
# check missing values again and display    
df3.isnull().sum().sort_values(ascending=False)

embark_town    2
survived       0
sex            0
age            0
sibsp          0
pclass         0
parch          0
fare           0
class          0
embarked       0
who            0
adult_male     0
alive          0
alone          0
dtype: int64

In [34]:
# impute missing values in embark_town column with most frequent value using pandas
#df5 = df.copy()
df3['embark_town'] = df3['embark_town'].fillna(df3['embark_town'].mode()[0])
# check missing values again and display
df3.isnull().sum().sort_values(ascending=False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

### second method by using sklearn SimpleImputer
from sklearn.impute import SimpleImputer

In [46]:
# impute age column with mean value
df4 = df.copy()
imputer = SimpleImputer(strategy='mean')
df4['age'] = imputer.fit_transform(df4[['age']]).flatten()
# impute embarked column with most frequent value
imputer = SimpleImputer(strategy='most_frequent')
df4['embarked'] = imputer.fit_transform(df4[['embarked']]).flatten()

# impute embark_town column with most frequent value
imputer = SimpleImputer(strategy='most_frequent')
df4['embark_town'] = imputer.fit_transform(df4[['embark_town']]).ravel()    
# check missing values again
df4.isnull().sum().sort_values(ascending=False)
# drop deck column as it has too many missing values
df4.drop(columns=['deck'], inplace=True, errors='ignore')
# check missing values again
df4.isnull().sum().sort_values(ascending=False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

### label encoding for categorical variables
from sklearn.preprocessing import LabelEncoder

In [47]:
# encode categorical variables using LabelEncoder  
from sklearn.preprocessing import LabelEncoder
 # columns to be encoded
cat_cols = ['sex', 'embarked', 'embark_town', 'class', 'who','embark_town', 'alive']
# create LabelEncoder object
le = LabelEncoder() 
# encode each categorical column
for col in cat_cols:
    df4[col] = le.fit_transform(df4[col])   
# display first 5 rows of encoded dataframe
df4.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,1,22.0,1,0,7.2500,2,2,1,True,2,0,False
1,1,1,0,38.0,1,0,71.2833,0,0,2,False,0,1,False
2,1,3,0,26.0,0,0,7.9250,2,2,2,False,2,1,True
3,1,1,0,35.0,1,0,53.1000,2,0,2,False,2,1,False
4,0,3,1,35.0,0,0,8.0500,2,2,1,True,2,0,True

In [52]:
df5 =df.copy()
# impute the missing values with iterative imputer
from sklearn.experimental import enable_iterative_imputer
from sklearn.impute import IterativeImputer
imputer = IterativeImputer(max_iter=10, random_state=0)
# columns to be imputed
cols_to_impute = ['age', 'embarked', 'embark_town']
for col in cols_to_impute:
    df4[col] = imputer.fit_transform(df4[[col]]).ravel()
# check missing values again
df4.isnull().sum().sort_values(ascending=False)

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    0
alive          0
alone          0
dtype: int64

In [55]:
df6 = df.copy()
# impute the age column using random forest regressor
from sklearn.ensemble import RandomForestRegressor
from sklearn.model_selection import train_test_split
# separate rows with and without missing age values
df_age_missing = df6[df6['age'].isnull()]
df_age_not_missing = df6[df6['age'].notnull()]
# print shapes of the two dataframes
print("Shape of df_age_missing:", df_age_missing.shape)
print("Shape of df_age_not_missing:", df_age_not_missing.shape)
# features to be used for prediction
features = ['pclass', 'sibsp', 'parch', 'fare']
# prepare training data

X = df_age_not_missing[features]
y = df_age_not_missing['age']   
# split into training and testing sets
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.2, random_state=42)
# create RandomForestRegressor model
rf_regressor = RandomForestRegressor(random_state=42)
# train the model
rf_regressor.fit(X_train, y_train)
# predict missing age values
predicted_ages = rf_regressor.predict(df_age_missing[features])
# fill the missing age values in the original dataframe
df6.loc[df6['age'].isnull(), 'age'] = predicted_ages    
# check missing values again
df6.isnull().sum().sort_values(ascending=False)
# head of missing v
df_age_missing.head()

Shape of df_age_missing: (177, 15)
Shape of df_age_not_missing: (714, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
17,1,2,male,NaN,0,0,13.0000,S,Second,man,True,NaN,Southampton,yes,True
19,1,3,female,NaN,0,0,7.2250,C,Third,woman,False,NaN,Cherbourg,yes,True
26,0,3,male,NaN,0,0,7.2250,C,Third,man,True,NaN,Cherbourg,no,True
28,1,3,female,NaN,0,0,7.8792,Q,Third,woman,False,NaN,Queenstown,yes,True